


&НаКлиенте
Процедура ПриИзмененииПараметровЭкрана()
	ОбработкаИзмененияЭкрана(ТекущаяВысота, ТекущаяШирина);	
	Элементы.ТекущаяОриентацияЭкрана.Группировка = ?(ТекущаяШирина > ТекущаяВысота, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная,ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбработкаИзмененияЭкрана(НачальнаяВысота, НачальнаяШирина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияЭкрана(Высота, Ширина)
	
	Экран = ПолучитьИнформациюЭкрановКлиента();
	ТекущийЭкран = Экран[0];
	Высота = ТекущийЭкран.Высота;
	Ширина = ТекущийЭкран.Ширина;
	Элементы.ТекущаяОриентацияЭкрана.Заголовок = "Текущая ориентация: " + ?(Ширина > Высота, "Альбом", "Портрет") + ", DPI:" + ТекущийЭкран.DPI;
КонецПроцедуры

