&НаКлиенте
Процедура Отсканировать(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда
			ОпСканирования = Новый ОписаниеОповещения("ОбработкаОтсканированногоШтрихкода", ЭтаФорма);
			ОпОтказСканирования = Новый ОписаниеОповещения("ОбработкаОтказаСканирования", ЭтаФорма, "Отказ сканирования");
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Просканируйте штрихкод",ОпСканирования, ОпОтказСканирования, ТипШтрихКода.Все);
		Иначе
			Сообщить("Не поддерживается сканирование штрихкодов!");
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры

Процедура ОбработкаОтсканированногоШтрихкода(Штрихкод,Результат,Сообщение, ДопПараметр)
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Результат = ГСЧ.СлучайноеЧисло(0,1);
	Если Результат Тогда
		СтрШтрихкода = Штрихкода.НайтиСтроки(Новый Структура("Штрихкод", Штрихкод));
		Если СтрШтрихкода.Количество() Тогда
			СтрШтрихкода[0].Количество = СтрШтрихкода[0].Количество + 1;
			Сообщение = "Итого по штрихкоду:" + Штрихкод + ", кол: " + СтрШтрихкода[0].Количество;
		Иначе
			Нов = Штрихкода.Добавить();
			Нов.Штрихкод = Штрихкод;
			Нов.Количество = 1;
			Сообщение = "Новая позиция:" + Штрихкод;
		КонецЕсли;
		
		
	КонецЕсли; 	
КонецПроцедуры

Процедура ОбработкаОтказаСканирования(Сообщение)
	Сообщить(Сообщение)
КонецПроцедуры

&НаКлиенте
Процедура ОтсканироватьАндроид(Команда)
	#Если МобильноеПриложениеКлиент Тогда
	//https://github.com/zxing/zxing/blob/master/android/src/com/google/zxing/client/android/Intents.java
	НовВз = Новый ЗапускПриложенияМобильногоУстройства;
	
	НовВз.Действие = "com.google.zxing.client.android.SCAN";
	//Приложение для сканирования
	НовВз.Приложение = "com.google.zxing.client.android";
	
	НовВз.ДополнительныеДанные.Добавить("SCAN_MODE", ВидШтрихкодов);
	//Через запятую можно указывать разные типы
	//https://zxing.github.io/zxing/apidocs/com/google/zxing/BarcodeFormat.html
	НовВз.ДополнительныеДанные.Добавить("SCAN_FORMATS", ТипШтрихкодаСканирования);
	НовВз.ДополнительныеДанные.Добавить("SCAN_CAMERA_ID", КамераДляСканирования,"int");
	НовВз.ДополнительныеДанные.Добавить("RESULT_DISPLAY_DURATION_MS", ЗадержкаСканирования, "long");
	НовВз.ДополнительныеДанные.Добавить("PROMPT_MESSAGE", Сообщение);
	
	Результат = НовВз.Запустить(Истина);
	
	Штрихкод.Очистить();
	Для Каждого Стр Из НовВз.ДополнительныеДанные Цикл
		Нов = Штрихкод.Добавить();
		Нов.Ключ = Стр.Ключ;
		Нов.Значение = Стр.Значение;
		Нов.ИмяТипа = Стр.ИмяТипа;
	КонецЦикла;
	#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СоздатьШтрихкод(Команда)
		#Если МобильноеПриложениеКлиент Тогда
	//https://github.com/zxing/zxing/blob/master/android/src/com/google/zxing/client/android/Intents.java
	НовВз = Новый ЗапускПриложенияМобильногоУстройства;
	
	НовВз.Действие = "com.google.zxing.client.android.ENCODE";
	//Приложение для сканирования
	НовВз.Приложение = "com.google.zxing.client.android";
	//Необходимо указывать только если указан тип QR. Список всех типов доступен тут:
	//https://github.com/zxing/zxing/blob/master/android/src/com/google/zxing/client/android/Contents.java
	НовВз.ДополнительныеДанные.Добавить("ENCODE_TYPE", ТипДанных);
	НовВз.ДополнительныеДанные.Добавить("ENCODE_DATA", ТекстШтрихкода, Строка(ТипAndroid));
	НовВз.ДополнительныеДанные.Добавить("ENCODE_FORMAT", ВидШтрихкодаДляГенерации);
	НовВз.ДополнительныеДанные.Добавить("ENCODE_SHOW_CONTENTS", ОтображатьТекстСообщения, "boolean");

	Результат = НовВз.Запустить(Истина);
	
	Штрихкод.Очистить();
	Для Каждого Стр Из НовВз.ДополнительныеДанные Цикл
		Нов = Штрихкод.Добавить();
		Нов.Ключ = Стр.Ключ;
		Нов.Значение = Стр.Значение;
		Нов.ИмяТипа = Стр.ИмяТипа;
	КонецЦикла;
	#КонецЕсли

КонецПроцедуры
