&НаКлиенте
Функция ОбработкаВызоваВыбораПути(ВыборПапки = Ложь, MIMEТип = "*")  Экспорт
	Если ОбщиеФункции.ПолучитьОС() = ПредопределенноеЗначение("Перечисление.МобильныеОС.Android") Тогда
		СписокЗн = Новый СписокЗначений;
		СписокЗн.Добавить("1С", "1С");
		СписокЗн.Добавить("ES", "ES Explorer");
		СписокЗн.Добавить("Android", "Android");
		СписокЗн.Добавить("Отмена", "Отмена");

		Ответ = Вопрос("Каким методом выбрать папку?",СписокЗн,,,"Выберите метод"); 
	Иначе
		Ответ = "1С";
	КонецЕсли;
	
	Если Ответ = "1С" Тогда
		СтандартнаяОбработка = Ложь;
		 Возврат ОткрытьФормуМодально("ОбщаяФорма.ВыбратьФайл",  Новый Структура("ВыборКаталога", ВыборПапки));		
	ИначеЕсли Ответ = "ES" Тогда
		#Если МобильноеПриложениеКлиент Тогда
			ДейтвиеВызова = ?(ВыборПапки,"com.estrongs.action.PICK_DIRECTORY","com.estrongs.action.PICK_FILE");
			
			НовВз = Новый ЗапускПриложенияМобильногоУстройства(ДейтвиеВызова);        
			ВремяЗапускаПриложения = ТекущаяУниверсальнаяДатаВМиллисекундах();
			НовВз.Тип = "file/*";
			РезультатРаботы = НовВз.Запустить(Истина);
			
			Если НЕ РезультатРаботы Тогда
				Если ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяЗапускаПриложения < 100 Тогда //Ошибка запуска
					Если Вопрос("Возможно у вас не установлен ES Explorer. Хотите установить?", РежимДиалогаВопрос.ДаНет,,,"Внимание!") = КодВозвратаДиалога.Да Тогда
						ЗапуститьПриложение("market://details?id=com.estrongs.android.pop");	
					КонецЕсли;	
				Иначе //Отменил пользователь, или ошибка произошла во время работы приложения
				КонецЕсли;				
				Возврат ""
			КонецЕсли;
			Путь = СтрЗаменить(НовВз.Данные,"file://","");
			ОбПуть = Новый Файл(Путь);
			Если НЕ ОбПуть.Существует() Тогда
				Сообщить("Выран не верный путь, или 1С не имеет прав доступа к этой папке!" + Символы.ПС + Путь);
				Возврат "";
			КонецЕсли;
			Возврат Путь;
		#КонецЕсли
	ИначеЕсли Ответ = "Android" Тогда
		#Если МобильноеПриложениеКлиент Тогда
			НовВз = Новый ЗапускПриложенияМобильногоУстройства();
			//НовВз.Действие = "android.intent.action.PICK";
			НовВз.Действие = "android.intent.action.GET_CONTENT";  //Нельязя использовать, так как 1с пока не умеет работать с конекстом данных.
			НовВз.Категория = "android.intent.category.OPENABLE";
			//Указываем тип искомых файлов, нас интересует только фото
			НовВз.Тип = MIMEТип;//"folder/*"; //"image/*"; //"file/*"; //"*/*"
			//Говорим что интересуют только локальные данные, а не облачные
			НовВз.ДополнительныеДанные.Добавить("android.intent.extra.LOCAL_ONLY",Истина);
			РезультатРаботы = НовВз.Запустить(Истина);
			Если НЕ РезультатРаботы Тогда
				Сообщить("Файл не выбран!");
				Возврат ""
			КонецЕсли;
			Путь = СтрЗаменить(НовВз.Данные,"file://","");
			Путь = СтрЗаменить(НовВз.Данные,"content:/","");
			ОбПуть = Новый Файл(Путь);
			Если НЕ ОбПуть.Существует() Тогда
				Сообщить("Выбран не верный путь, или 1С не имеет прав доступа к этой папке!" + Символы.ПС + Путь);
				Возврат "";
			КонецЕсли;
			Сообщить(Путь);
			Возврат Путь;
		#КонецЕсли
	КонецЕсли;


КонецФункции

&НаКлиенте
Функция ПолучитьПуть(ПутьДляСохраненияФайлов, НуженURI) Экспорт
	Если НЕ ЗначениеЗаполнено(ПутьДляСохраненияФайлов) Тогда
		ПутьДляСохраненияФайлов = КаталогДокументов();
	КонецЕсли;
	Путь = ?(НуженURI, "file://" + ПутьДляСохраненияФайлов,ПутьДляСохраненияФайлов);
	Путь = ?(Прав(Путь,1) = "/", Путь, Путь + "/");
	//Сообщить(Путь);
	Возврат Путь;
КонецФункции

&НаКлиенте
Функция ПолучитьОС() Экспорт
	Возврат СервисныйМодуль.ВернутьТипИспользуемойОС();
КонецФункции

&НаКлиенте
Процедура ОбработчикЛокальныхУведомлений(Уведомление,Локальное,Показано, ДопПараметр) Экспорт
	ТекстСообщения = "";
	ТекстСообщения = ТекстСообщения + "Дата: " 		+ ТекущаяДата() 				+ Символы.ПС;
	ТекстСообщения = ТекстСообщения + "Вызов из: " 	+ ДопПараметр 					+ Символы.ПС;
	ТекстСообщения = ТекстСообщения + "Текст: " 	+ СервисныйМодуль.URLDecode(Уведомление.Текст) 	+ Символы.ПС;	
	ТекстСообщения = ТекстСообщения + "Данные: " 	+ СервисныйМодуль.URLDecode(Уведомление.Данные) + Символы.ПС;	
	ТекстСообщения = ТекстСообщения + "Локальное: " + Локальное 					+ Символы.ПС;
	ТекстСообщения = ТекстСообщения + "Показано: " 	+ Показано 						+ Символы.ПС;
	Сообщить(ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикУведомленийИзОбщегоМодуля() Экспорт
	#Если МобильноеПриложениеКлиент Тогда
	Оп = Новый ОписаниеОповещения("ОбработчикЛокальныхУведомлений", ОбщиеФункции, "Этот обработчик вызван из общего модуля");
	ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(Оп);
	#КонецЕсли
КонецПроцедуры

