
&НаКлиенте
Процедура ВыгрузитьДанныеВXML(Команда)
	#Если ТонкийКлиент Тогда
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Расширение = "xml";
	Диалог.Заголовок = "Куда сохранить данные?";
	
	Если НЕ Диалог.Выбрать() Тогда Возврат КонецЕсли;
	
	ДеревоВОбъектеXDTO = ПолучитьОбъектыНаСервере(Диалог.ПолноеИмяФайла);
	#КонецЕсли
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектыНаСервере(ПолноеИмяФайла)
	
	МассивОбъект = Новый Массив;
	Выборка = Справочники.ТестированиеИнтентов.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивОбъект.Добавить(Выборка.ПолучитьОбъект());
	КонецЦикла;
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(МассивОбъект);
		
	МойXML = Новый ЗаписьXML;
	МойXML.ОткрытьФайл(ПолноеИмяФайла);
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь); 
	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	МойXML.Закрыть();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПредопределенныеДанные(Команда)
	ОбновитьПредопределенныеДанныеНаСервере();
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьПредопределенныеДанныеНаСервере()
	Макет = Справочники.ТестированиеИнтентов.ПолучитьМакет("МакетПредопределенныхДанных");
	
	ТекстДанных = Макет.Область(1,1).Текст;
	
	МассивОбъектов = СервисныйМодуль.Десериализовать(ТекстДанных);
	
	Для Каждого Об Из МассивОбъектов Цикл
		Об.ОбменДанными.Загрузка = Истина;
		Об.Записать();
	КонецЦикла;

	
КонецПроцедуры


