
Процедура УстановкаПараметровСеанса()
	#Если МобильноеПриложениеСервер Тогда
	СисИнфо = Новый СистемнаяИнформация;
	Если Найти(СисИнфо.ВерсияОС, "iOS") Тогда
		Константы.МобильнаяОС.Установить(Перечисления.МобильныеОС.iOS);
	ИначеЕсли Найти(СисИнфо.ВерсияОС, "Android") Тогда
		Константы.МобильнаяОС.Установить(Перечисления.МобильныеОС.Android);
	ИначеЕсли Найти(СисИнфо.ВерсияОС, "Windows") ИЛИ Найти(Строка(СисИнфо.ТипПлатформы), "Windows") Тогда
		Константы.МобильнаяОС.Установить(Перечисления.МобильныеОС.Windows);
	КонецЕсли;     
	#КонецЕсли
КонецПроцедуры
