
&НаКлиенте
Процедура К2(Команда)
	ПоискТекСтрока();
КонецПроцедуры

&НаКлиенте
Процедура К1(Команда)
	ПоискТекСтрока();
КонецПроцедуры

&НаКлиенте
Процедура ТестоваяТаблицаОбработкаЗапросаОбновления()
	Нов = ТестоваяТаблица.Добавить();
	Нов.Наименование = "Обновлена в " + ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ТекСтрока(Команда)
	ПоискТекСтрока();
КонецПроцедуры

&НаКлиенте
Процедура ПоискТекСтрока()
	
	Перем ТекСтр;
	Если Элементы.Группа1.ТекущаяСтраница = Элементы.Группа2 Тогда
		ТекСтр = Элементы.ТестоваяТаблица.ТекущиеДанные;
	Иначе
		ТекСтр = Элементы.ДС.ТекущиеДанные;
	КонецЕсли;
	Если ТекСтр = Неопределено Тогда
		Сообщить("Текущая строка не найдена");
	Иначе
		Сообщить(ТекСтр.Наименование);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура МножественныйВыбор(Команда)
	Табл = ?(Элементы.Группа1.ТекущаяСтраница = Элементы.Группа2,"ТестоваяТаблица", "ДС");

	ТекСтр = Элементы[Табл].ВыделенныеСтроки;

	Для Каждого Стр Из ТекСтр Цикл
		ПоискСтр = ЭтаФорма[Табл].НайтиПоИдентификатору(Стр);
		Сообщить(ПоискСтр.Наименование);
	КонецЦикла;
	
	Сообщить("Всего выбрано " + ТекСтр.Количество() + " строк!");

КонецПроцедуры

