
&НаКлиенте
Процедура СоздатьПользователя(Команда)
		СоздатьПользователяФрагмент();
		Сообщить("Перезайдите в базу.");

КонецПроцедуры

&НаСервере
Процедура СоздатьПользователяФрагмент()
    
    Перем Нов, СпРоль;
	Если ЗначениеЗаполнено(ИмяПользователя) Тогда
    	Нов = ПользователиИнформационнойБазы.СоздатьПользователя();
    	Нов.Имя = ИмяПользователя;
	Иначе
		Нов =  ПользователиИнформационнойБазы.ТекущийПользователь();
		Нов.Роли.Очистить();
	КонецЕсли;

	Для каждого СпРоль Из ДоступныеРоли Цикл
		Если Не СпРоль.Выбрать Тогда Продолжить КонецЕсли; 
        Нов.Роли.Добавить(Метаданные.Роли[Спроль.Роль]);
    КонецЦикла;
	Нов.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсехПользователей(Команда)
	ПолучитьСписокПользователей()
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьСписокПользователей()
	ВсеПользователи = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Если ВсеПользователи.Количество() = 0 Тогда Сообщить("В базе нет пользователей!") КонецЕсли;
	Для каждого Польз Из ВсеПользователи Цикл
		Сообщить(Польз.Имя);
	КонецЦикла; 
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Роль Из Метаданные.Роли Цикл
		Нов=ДоступныеРоли.Добавить();
		Нов.Роль = Роль;
		Нов.Роль = Роль.Имя;
		Нов.Выбрать = Истина;
	КонецЦикла; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчисткаБазыНаСервере()
	УдалитьДанныеИнформационнойБазы();
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаБазы(Команда)
	ОчисткаБазыНаСервере();
	Сообщить("База данных была очищена!");
КонецПроцедуры

#Область ФоновыеЗадания
&НаКлиенте
Процедура ЗапускФоновогоЗаданияКлиент(Команда)
	ЗапускФоновогоЗаданияНаСервере(ИнтервалВыполнения);
	Сообщить("Задание запущено!");
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗапускФоновогоЗаданияНаСервере(Интервал)
	Массив = Новый Массив;
	Массив.Добавить(Интервал);
	УИД = Новый УникальныйИдентификатор;
	Массив.Добавить(УИД);
	Задание = ФоновыеЗадания.Выполнить("МодульФоновыхЗаданий.ЗапуститьФоновоеЗадание", Массив,УИД,"Задание от " + ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НайтиЗадания(Команда)
	НайтиЗаданияНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиЗаданияНаСервере()
	ВсеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	ТЗФоновыеЗадания.Очистить();
	Для каждого ФонЗадание Из ВсеЗадания Цикл
		Нов = ТЗФоновыеЗадания.Добавить();
		Нов.СостояниеФоновогоЗадания = ФонЗадание.Состояние;
		Нов.ID = ФонЗадание.УникальныйИдентификатор;
		Нов.Имя = ФонЗадание.Наименование;
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ОтключитьЗадание(Команда)
	ОтключитьЗаданиеНаСервере(Элементы.ТЗФоновыеЗадания.ТекущиеДанные.ID);
КонецПроцедуры

&НаСервере
Процедура ОтключитьЗаданиеНаСервере(ID)
	ФонЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ID);
	Если ФонЗадание = Неопределено Тогда Сообщить("Не найдено фоновое задание") КонецЕсли;
	ФонЗадание.Отменить();
	Сообщить("Фоновое задание отменено!");
КонецПроцедуры
 
#КонецОбласти 