Процедура ЗапуститьФоновоеЗадание(Интервал,УИД) Экспорт
	ДлительностьОжидания = ?(Интервал > 0, Интервал, 5);	
	Пока Истина Цикл
		ДатаНачала = ТекущаяДата();
		
		
		ДатаТек = ДатаНачала;
		Пока ДатаТек < ДатаНачала + ДлительностьОжидания Цикл
			ДатаТек = ТекущаяДата();
		КонецЦикла;
		СервисныйМодуль.ПредопределенноеПодключение("/notification?title=ФоновоеЗадание&message=" + Формат(ТекущаяДата(),"ДФ='dd.MM.yyyy чч.мм.сс'") + "&level=0");		
		Нов = РегистрыСведений.ЖурналРезультатов.СоздатьМенеджерЗаписи();
		Нов.ID = УИД;
		Нов.Данные = "Фоновое задание с интервалом " + Интервал;
		Нов.Период = ТекущаяДата();
		Нов.Записать(Ложь);
	КонецЦикла;
КонецПроцедуры
