
&НаКлиенте
Процедура ВыполнитьИнтент(Команда)

	#Если МобильноеПриложениеКлиент Тогда
	НовВз = Новый ЗапускПриложенияМобильногоУстройства;
	ЗаполнитьЗначенияСвойств(НовВз, Объект);
	Для Каждого Стр Из Объект.ДопДанные Цикл
		НовВз.ДополнительныеДанные.Добавить(Стр.Имя, Стр.Значение, Строка(Стр.Тип));
	КонецЦикла;
	
	Результат = НовВз.Запустить(Истина);
	Данные = НовВз.Данные;
	ДопДанныеРезультат.Очистить();
	Для Каждого Стр Из НовВз.ДополнительныеДанные Цикл
		Нов = ДопДанныеРезультат.Добавить();
		Нов.Имя = Стр.Ключ;
		Нов.Значение = Стр.Значение;
		Нов.ТипДанных = Стр.ИмяТипа;
	КонецЦикла;
	Элементы.Группа1.ТекущаяСтраница = Элементы.Результат;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Справка Тогда
		ЗагрузкаСправки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаСправки()
	
	Объект.URL = "http://developer.android.com/intl/ru/tools/sdk/tools-notes.html#q="+Объект.Действие;
	
КонецПроцедуры
