
&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		Если СредстваПочты.ПоддерживаетсяОтправка() Тогда
			
			Письмо = Новый ИнтернетПочтовоеСообщение;
			
			СтрокаПолучатели = СтрРазделить(Получатели, ",; ",Ложь);
			Для Каждого Стр Из СтрокаПолучатели Цикл
				Письмо.Получатели.Добавить(Стр);
			КонецЦикла;
			
			Письмо.Тексты.Добавить(ТекстСообщения);
			Письмо.Тема = ТемаСообщения;		
			
			Для каждого Эл Из ТаблицаВложений Цикл
				Письмо.Вложения.Добавить(Эл.ПутьКФайлу);
			КонецЦикла; 
			СредстваПочты.Послать(Письмо);
		Иначе
			Сообщить("Не поддерживается работа с отправкой почты!");
		КонецЕсли; 
	#КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура Альтернатива(Команда)
	//Вложения не поддерживаются
	ЗапуститьПриложение("mailto:" + Получатели + "?subject=" + ТемаСообщения + "&body=" + ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВложенийПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Путь = ОткрытьФормуМодально("ОбщаяФорма.ВыбратьФайл");
	Если ЗначениеЗаполнено(Путь) Тогда
		Элементы.ТаблицаВложений.ТекущиеДанные.ПутьКФайлу = Путь;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ТабличцаВложенийПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Элементы.ТаблицаВложений.ТекущиеДанные.ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВложенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	СтандартнаяОбработка = Ложь;
	Отказ = Истина;
	Путь = ОбщиеФункции.ОбработкаВызоваВыбораПути(, "*.*");
	Если ЗначениеЗаполнено(Путь) Тогда
		Нов = ТаблицаВложений.Добавить();
		Нов.ПутьКФайлу = Путь;	
	КонецЕсли;
КонецПроцедуры


