
&НаКлиенте
Процедура ОриентацияЭкрана(Команда)
	ОткрытьФорму("Обработка.НовоеВФормах.Форма.ОбработкаПоворотаЭкрана");
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтображенияСтраниц(Команда)
	ОткрытьФорму("Обработка.НовоеВФормах.Форма.ВсеВидыОтображенияСтраниц");
КонецПроцедуры

&НаКлиенте
Процедура РаботаСКартинками(Команда)
	ОткрытьФорму("Обработка.НовоеВФормах.Форма.РаботаСКартинками");
КонецПроцедуры

&НаКлиенте
Процедура РаботаСТаблицами(Команда)
	ОткрытьФорму("Обработка.НовоеВФормах.Форма.РаботаСТаблицами");
КонецПроцедуры
