&НаКлиенте
Процедура ПриОткрытии()
  
	Если ЗначениеЗаполнено(Параметры.НачальныйПуть) Тогда
		Элементы.ОсновныеКаталоги.СписокВыбора.Добавить(Параметры.НачальныйПуть, "Текущий каталог");
		ОсновныеКаталоги = Параметры.НачальныйПуть;
	Иначе
		Если ОбщиеФункции.ПолучитьОС() <> ПредопределенноеЗначение("Перечисление.МобильныеОС.Windows") Тогда
			ОсновныеКаталоги = "/sdcard";
		Иначе
			ОсновныеКаталоги = "C:\Data\Users\Public\";
		КонецЕсли;
	КонецЕсли; 
	
	Если Параметры.ВыборПутиСохранения Тогда
		ВыборПутиСохранения = Истина;
		Элементы.ГруппаСохраненияФайла.Видимость = Истина;
		ИмяФайла = Параметры.ИмяФайла;
		Расширение = Параметры.Расширение;
	КонецЕсли; 
	
	ВыборКаталога = Параметры.ВыборКаталога;
	Элементы.ОсновныеКаталоги.СписокВыбора.Добавить(ОсновныеКаталоги,"'" + ОсновныеКаталоги + "' Основной каталог");
	Если ОбщиеФункции.ПолучитьОС() = ПредопределенноеЗначение("Перечисление.МобильныеОС.Windows") Тогда
		ФайлыИПапки = НайтиФайлы("/storage","*");
		Для каждого Эл Из ФайлыИПапки Цикл
			Элементы.ОсновныеКаталоги.СписокВыбора.Добавить(Эл.ПолноеИмя, Эл.Имя);
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ОсновныеКаталоги.СписокВыбора.Добавить(КаталогВременныхФайлов(), "Временные файлы");
	Элементы.ОсновныеКаталоги.СписокВыбора.Добавить(КаталогДокументов(), "Каталог документов");
	
	ОсновныеКаталогиПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеКаталогиПриИзменении()
	СписокФайлов.ПолучитьЭлементы().Очистить();
	Нов = СписокФайлов.ПолучитьЭлементы().Добавить();
	Нов.Имя = ОсновныеКаталоги;
	Нов.ПолныйПуть = ОсновныеКаталоги;
	Нов.ИндексКартинки = ПолучитьИндексПиктограммыФайла("", Истина);
	Нов.ЭтоПапка = Истина;
	ДобавитьВДерево(ОсновныеКаталоги, Нов);
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВДерево(Путь, ЭлРодителя)
	ФайлыИПапки = НайтиФайлы(Путь,"*");
	Для каждого Эл Из ФайлыИПапки Цикл
		Попытка
			Если НЕ Эл.Существует() Тогда Продолжить КонецЕсли;
			//Не будем выводить невидимые файлы и папки. Чаще всего - это системные.
			Если Эл.ПолучитьНевидимость() Тогда Продолжить КонецЕсли;
			ЭтоПапка = НЕ Эл.ЭтоФайл();
	
			Если (НЕ ЭтоПапка И ВыборПутиСохранения) ИЛИ (НЕ ЭтоПапка И ВыборКаталога) Тогда Продолжить КонецЕсли; 
			ОснЭлементы = ЭлРодителя.ПолучитьЭлементы();
			Нов = ОснЭлементы.Добавить();
			Нов.Имя = Эл.Имя;
			Нов.ПолныйПуть = Эл.ПолноеИмя;
			Нов.ИндексКартинки = ПолучитьИндексПиктограммыФайла(Эл.Расширение, ЭтоПапка);
			Нов.ЭтоПапка = ЭтоПапка;
			
			Нов.РазмерФайла = ?(ЭтоПапка, 0, Эл.Размер());
			
			
			Если ЭтоПапка Тогда				
				ОснЭлементы.Сдвинуть(ОснЭлементы.Индекс(Нов), -ОснЭлементы.Индекс(Нов));  //Папки вверху
				
				//ФайлыИПапкиВл = НайтиФайлы(Нов.ПолныйПуть,"*"); 
				//ФайлыВл = НайтиФайлы(Нов.ПолныйПуть,"*.*");
				//Если ФайлыИПапкиВл.Количество() <= ФайлыВл.Количество() Тогда Продолжить КонецЕсли;
				
				Нов = Нов.ПолучитьЭлементы().Добавить();
				Нов.Имя = "";
				Нов.ПолныйПуть = "";
				Нов.ИндексКартинки = "";
				Нов.ЭтоПапка = Ложь;
				
				Нов.РазмерФайла = 0;	
				
			КонецЕсли;
			
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Функция ПолучитьИндексПиктограммыФайла(РасширениеФайла, ЭтоПапка)
	
	Если ЭтоПапка Тогда
		Возврат 2
	КонецЕсли; 
	
	Если ТипЗнч(РасширениеФайла) <> Тип("Строка")
	 ИЛИ ПустаяСтрока(РасширениеФайла) Тогда
		
		Возврат 0;
	КонецЕсли;
	
	Расширение = НРег(РасширениеФайла) + ";";
	
	Если Найти(".dt;.1cd;.cf;.cfu;", Расширение) <> 0 Тогда
		Возврат 6; //Файлы 1С.
		
	ИначеЕсли Расширение = ".mxl;" Тогда
		Возврат 8; //Табличный Файл.
		
	ИначеЕсли Найти(".txt;.log;.ini;", Расширение) <> 0 Тогда
		Возврат 10; // Текстовый Файл.
		
	ИначеЕсли Расширение = ".epf;" Тогда
		Возврат 12; //Внешние обработки.
		
	ИначеЕсли Найти(".ico;.wmf;.emf;",Расширение) <> 0 Тогда
		Возврат 14; // Картинки.
		
	ИначеЕсли Найти(".htm;.html;.url;.mht;.mhtml;",Расширение) <> 0 Тогда
		Возврат 16; // HTML.
		
	ИначеЕсли Найти(".doc;.dot;.rtf;",Расширение) <> 0 Тогда
		Возврат 18; // Файл Microsoft Word.
		
	ИначеЕсли Найти(".xls;.xlw;",Расширение) <> 0 Тогда
		Возврат 20; // Файл Microsoft Excel.
		
	ИначеЕсли Найти(".ppt;.pps;",Расширение) <> 0 Тогда
		Возврат 22; // Файл Microsoft PowerPoint.
		
	ИначеЕсли Найти(".vsd;",Расширение) <> 0 Тогда
		Возврат 24; // Файл Microsoft Visio.
		
	ИначеЕсли Найти(".mpp;",Расширение) <> 0 Тогда
		Возврат 26; // Файл Microsoft Visio.
		
	ИначеЕсли Найти(".mdb;.adp;.mda;.mde;.ade;",Расширение) <> 0 Тогда
		Возврат 28; // База данных Microsoft Access.
		
	ИначеЕсли Найти(".xml;",Расширение) <> 0 Тогда
		Возврат 30; // xml.
		
	ИначеЕсли Найти(".msg;",Расширение) <> 0 Тогда
		Возврат 32; // Письмо электронной почты.
		
	ИначеЕсли Найти(".zip;.rar;.arj;.cab;.lzh;.ace;",Расширение) <> 0 Тогда
		Возврат 34; // Архивы.
		
	ИначеЕсли Найти(".exe;.com;.bat;.cmd;",Расширение) <> 0 Тогда
		Возврат 36; // Исполняемые файлы.
		
	ИначеЕсли Найти(".grs;",Расширение) <> 0 Тогда
		Возврат 38; // Графическая схема.
		
	ИначеЕсли Найти(".geo;",Расширение) <> 0 Тогда
		Возврат 40; // Географическая схема.
		
	ИначеЕсли Найти(".jpg;.jpeg;.jp2;.jpe;",Расширение) <> 0 Тогда
		Возврат 42; // jpg.
		
	ИначеЕсли Найти(".bmp;.dib;",Расширение) <> 0 Тогда
		Возврат 44; // bmp.
		
	ИначеЕсли Найти(".tif;.tiff;",Расширение) <> 0 Тогда
		Возврат 46; // tif.
		
	ИначеЕсли Найти(".gif;",Расширение) <> 0 Тогда
		Возврат 48; // gif.
		
	ИначеЕсли Найти(".png;",Расширение) <> 0 Тогда
		Возврат 50; // png.
		
	ИначеЕсли Найти(".pdf;",Расширение) <> 0 Тогда
		Возврат 52; // pdf.
		
	ИначеЕсли Найти(".odt;",Расширение) <> 0 Тогда
		Возврат 54; // Open Office writer.
		
	ИначеЕсли Найти(".odf;",Расширение) <> 0 Тогда
		Возврат 56; // Open Office math.
		
	ИначеЕсли Найти(".odp;",Расширение) <> 0 Тогда
		Возврат 58; // Open Office Impress.
		
	ИначеЕсли Найти(".odg;",Расширение) <> 0 Тогда
		Возврат 60; // Open Office draw.
		
	ИначеЕсли Найти(".ods;",Расширение) <> 0 Тогда
		Возврат 62; // Open Office calc.
		
	ИначеЕсли Найти(".mp3;",Расширение) <> 0 Тогда
		Возврат 64;
		
	ИначеЕсли Найти(".erf;",Расширение) <> 0 Тогда
		Возврат 66; // Внешние отчеты.
		
	ИначеЕсли Найти(".docx;",Расширение) <> 0 Тогда
		Возврат 68; // Файл Microsoft Word docx.
		
	ИначеЕсли Найти(".xlsx;",Расширение) <> 0 Тогда
		Возврат 70; // Файл Microsoft Excel xlsx.
		
	ИначеЕсли Найти(".pptx;",Расширение) <> 0 Тогда
		Возврат 72; // Файл Microsoft PowerPoint pptx.
		
	ИначеЕсли Найти(".p7s;",Расширение) <> 0 Тогда
		Возврат 74; // Файл подписи.
		
	ИначеЕсли Найти(".p7m;",Расширение) <> 0 Тогда
		Возврат 76; // зашифрованное сообщение.
	Иначе
		Возврат 4;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОткрытьВыбранныйФайл(Команда)
	Сообщить(Элементы.СписокФайлов.ТекущиеДанные.ПолныйПуть);
	ЗапуститьПриложение(Элементы.СписокФайлов.ТекущиеДанные.ПолныйПуть);
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокФайлов.ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	ТекущийПуть = "";
	Если НЕ Элементы.СписокФайлов.ТекущиеДанные.ЭтоПапка Тогда
		ТекущийПуть = "Размер файла: " + ПолучитьРазмер(Элементы.СписокФайлов.ТекущиеДанные.РазмерФайла) + Символы.ПС;
	КонецЕсли;  
	ПолныйПуть = Элементы.СписокФайлов.ТекущиеДанные.ПолныйПуть;
	ТекущийПуть = ПолныйПуть;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРазмер(Размер)
	Если Размер < 1024 Тогда
		Возврат ""+Размер + "Б";
	ИначеЕсли Размер < 1024*1024 Тогда 
		Возврат "" + Цел(Размер/1024) + "кБ";
	Иначе
		Возврат "" + Цел(Размер/(1024*1024)) + "мБ";
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура Выбрать(Команда)
	Если ВыборПутиСохранения Тогда
		Закрыть(ТекущийПуть + "\" + ИмяФайла + "." + Расширение);
	Иначе
		Закрыть(Элементы.СписокФайлов.ТекущиеДанные.ПолныйПуть);
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПередРазворачиванием(Элемент, Строка, Отказ)
	ТекДанные = СписокФайлов.НайтиПоИдентификатору(Строка);
	ТекДанные.ПолучитьЭлементы().Очистить();
	Если ТекДанные.ЭтоПапка Тогда
		ДобавитьВДерево(ТекДанные.ПолныйПуть, ТекДанные);
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры
 





